#### TemperatureRatingTypeSetIterator Members

---

|  |
| --- |
| TemperatureRatingTypeSetIterator Class   Constructors   Methods   Properties   See Also |

The  TemperatureRatingTypeSetIterator  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | TemperatureRatingTypeSetIterator | For Internal Use Only. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Causes the object to release immediately any resources it may be utilizing. (Inherited from  APIObject  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | MoveNext | Move the iterator one item forward. |
| Public method | Reset | Bring the iterator back to the start of the set. |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Current | Retrieves the item that is the current focus of the iterator. |
| Public property | IsReadOnly | Identifies if the object is read-only or modifiable. (Inherited from  APIObject  .) |

# See Also

TemperatureRatingTypeSetIterator Class

Autodesk.Revit.DB.Electrical Namespace